Ran Plan for 2 projects:

1. dir: `external/iac/homelab/ec2/frp-server` workspace: `default`
1. dir: `external/iac/homelab/sg/netmaker` workspace: `default`

### 1. dir: `external/iac/homelab/ec2/frp-server` workspace: `default`
**Plan Error**
```
running "terragrunt0.40.0 plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/ec2/frp-server": exit status 1: running "terragrunt0.40.0 plan -input=false -out=$PLANFILE" in "/atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/ec2/frp-server": 
time=2023-02-17T15:52:20Z level=error msg=/atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/sg/netmaker/terragrunt.hcl is a dependency of /atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/ec2/frp-server/terragrunt.hcl but detected no outputs. Either the target module has not been applied yet, or the module has no outputs. If this is expected, set the skip_outputs flag to true on the dependency block.
time=2023-02-17T15:52:20Z level=error msg=Unable to determine underlying exit code, so Terragrunt will exit with error code 1


```

---
### 2. dir: `external/iac/homelab/sg/netmaker` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching ">= 3.29.0"...
- Using hashicorp/aws v4.55.0 from the shared cache directory

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Incomplete lock file information for providers
│ 
│ Due to your customized provider installation methods, Terraform was forced
│ to calculate lock file checksums locally for the following providers:
│   - hashicorp/aws
│ 
│ The current .terraform.lock.hcl file only includes checksums for
│ linux_amd64, so Terraform running on another platform will fail to install
│ these providers.
│ 
│ To calculate additional checksums for another platform, run:
│   terraform providers lock -platform=linux_amd64
│ (where linux_amd64 is the platform to generate)
╵

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "allow netmaker access"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "netmaker-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "homelab"
          + "Name"        = "netmaker-sg"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "homelab"
          + "Name"        = "netmaker-sg"
          + "Owner"       = "linhng98"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-03b003e069e39ab31"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # aws_security_group_rule.ingress_with_cidr_blocks[0] will be created
  + resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "wireguard port"
      + from_port                = 51821
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 51830
      + type                     = "ingress"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + security_group_arn         = (known after apply)
  + security_group_description = "allow netmaker access"
  + security_group_id          = (known after apply)
  + security_group_name        = (known after apply)
  + security_group_owner_id    = (known after apply)
  + security_group_vpc_id      = "vpc-03b003e069e39ab31"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/sg/netmaker/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/atlantis-data/repos/linhng98/mess-around/64/default/external/iac/homelab/sg/netmaker/default.tfplan"
Releasing state lock. This may take a few moments...
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d external/iac/homelab/sg/netmaker`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.homelab.linhng98.com/lock?id=linhng98%252Fmess-around%252Fexternal%252Fiac%252Fhomelab%252Fsg%252Fnetmaker%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d external/iac/homelab/sg/netmaker`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`